@echo off
rem ====================================================================
rem 1. 设置官方标准 Vivado 批处理入口路径
rem ====================================================================
set VIVADO_BIN=D:\Xilinx\Vivado\2024.1\bin\vivado.bat

rem ====================================================================
rem 2. 获取本脚本所在目录 (解决 Vivado 切换工作目录的问题)
rem ====================================================================
set SCRIPT_DIR=%~dp0
set TCL_DIR=%SCRIPT_DIR%..\..\..\tcl

rem ====================================================================
rem 3. 启动 Vivado TCL, 依次加载: 连接硬件 → 底层驱动 → 抓包功能
rem ====================================================================
call "%VIVADO_BIN%" -mode tcl -source %SCRIPT_DIR%lcpu_xilinx -source %SCRIPT_DIR%LCPU_AMD_Driver.tcl 

rem ====================================================================
rem 4. 暂停窗口
rem ====================================================================
pause